{"backend": "tensorflow", "config": [{"config": {"mask_value": -1, "name": "masking_1", "batch_input_shape": [null, 5, 11], "dtype": "float32", "trainable": true}, "class_name": "Masking"}, {"config": {"recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.2, "units": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 1, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "tanh", "recurrent_dropout": 0.0, "stateful": false, "return_sequences": false, "bias_constraint": null, "trainable": true, "unroll": false, "unit_forget_bias": true, "return_state": false, "name": "lstm_1", "recurrent_constraint": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "units": 6, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "batch_input_shape": [null, 32], "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_1", "dtype": "float32", "use_bias": true}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.1.6", "class_name": "Sequential"}